// Public game base attributes; no account data.
export default {
  "baseAttrMap": {
    "阿贝多": {
      "hp": 14165.6,
      "atk": 307.64,
      "def": 938.42
    },
    "阿蕾奇诺": {
      "hp": 14034.43,
      "atk": 418.98,
      "def": 819.06
    },
    "阿罗夏": {
      "hp": 12789.86,
      "atk": 333.23,
      "def": 751.62
    },
    "埃洛伊": {
      "hp": 11673.5,
      "atk": 286.54,
      "def": 724.4
    },
    "艾尔海森": {
      "hp": 14296.76,
      "atk": 383.82,
      "def": 837.17
    },
    "艾梅莉埃": {
      "hp": 14532.85,
      "atk": 410.19,
      "def": 782.02
    },
    "爱可菲": {
      "hp": 14296.76,
      "atk": 424.84,
      "def": 783.67
    },
    "爱诺": {
      "hp": 11975.96,
      "atk": 303.91,
      "def": 649.46
    },
    "安柏": {
      "hp": 10115.61,
      "atk": 279.92,
      "def": 642.16
    },
    "奥黛塔": {
      "hp": 13903.27,
      "atk": 410.19,
      "def": 842.94
    },
    "八重神子": {
      "hp": 11109.5,
      "atk": 416.05,
      "def": 609.15
    },
    "芭芭拉": {
      "hp": 10464.43,
      "atk": 199.94,
      "def": 715.14
    },
    "白术": {
      "hp": 14296.76,
      "atk": 235.86,
      "def": 535.07
    },
    "班尼特": {
      "hp": 13254.94,
      "atk": 239.93,
      "def": 824.6
    },
    "北斗": {
      "hp": 13952.57,
      "atk": 282.58,
      "def": 693.25
    },
    "布伦妮": {
      "hp": 10348.16,
      "atk": 277.25,
      "def": 620.27
    },
    "达达利亚": {
      "hp": 14034.43,
      "atk": 369.17,
      "def": 872.57
    },
    "迪奥娜": {
      "hp": 10231.89,
      "atk": 266.59,
      "def": 642.16
    },
    "迪卢克": {
      "hp": 13903.27,
      "atk": 410.19,
      "def": 839.64
    },
    "迪希雅": {
      "hp": 16788.85,
      "atk": 325.22,
      "def": 672.54
    },
    "杜林": {
      "hp": 13313.04,
      "atk": 424.84,
      "def": 880.8
    },
    "多莉": {
      "hp": 13254.94,
      "atk": 279.92,
      "def": 773.52
    },
    "法尔伽": {
      "hp": 13509.78,
      "atk": 432.16,
      "def": 851.99
    },
    "珐露珊": {
      "hp": 10231.89,
      "atk": 246.59,
      "def": 671.35
    },
    "菲林斯": {
      "hp": 13378.62,
      "atk": 430.7,
      "def": 865.98
    },
    "菲米尼": {
      "hp": 12906.13,
      "atk": 319.9,
      "def": 757.46
    },
    "菲谢尔": {
      "hp": 9824.94,
      "atk": 306.57,
      "def": 634.87
    },
    "枫原万叶": {
      "hp": 14296.76,
      "atk": 363.31,
      "def": 864.34
    },
    "芙宁娜": {
      "hp": 16395.36,
      "atk": 298.85,
      "def": 744.98
    },
    "甘雨": {
      "hp": 10493.03,
      "atk": 410.19,
      "def": 675.01
    },
    "哥伦比娅": {
      "hp": 15739.55,
      "atk": 117.2,
      "def": 551.53
    },
    "胡桃": {
      "hp": 16657.69,
      "atk": 130.38,
      "def": 938.42
    },
    "荒泷一斗": {
      "hp": 13772.11,
      "atk": 278.34,
      "def": 1027.33
    },
    "基尼奇": {
      "hp": 13772.11,
      "atk": 407.26,
      "def": 858.58
    },
    "嘉明": {
      "hp": 12208.5,
      "atk": 378.55,
      "def": 751.62
    },
    "九条裟罗": {
      "hp": 10231.89,
      "atk": 245.26,
      "def": 671.35
    },
    "久岐忍": {
      "hp": 13138.67,
      "atk": 266.59,
      "def": 802.71
    },
    "卡齐娜": {
      "hp": 12615.45,
      "atk": 271.92,
      "def": 847.22
    },
    "卡维": {
      "hp": 12789.86,
      "atk": 293.25,
      "def": 802.71
    },
    "凯亚": {
      "hp": 12441.04,
      "atk": 279.92,
      "def": 846.49
    },
    "坎蒂丝": {
      "hp": 11627.14,
      "atk": 266.59,
      "def": 729.73
    },
    "柯莱": {
      "hp": 10464.43,
      "atk": 250.59,
      "def": 642.16
    },
    "可莉": {
      "hp": 11017.69,
      "atk": 380.89,
      "def": 658.54
    },
    "克洛琳德": {
      "hp": 13877.04,
      "atk": 413.12,
      "def": 839.64
    },
    "刻晴": {
      "hp": 14034.43,
      "atk": 395.54,
      "def": 856.11
    },
    "菈乌玛": {
      "hp": 11411.17,
      "atk": 312.33,
      "def": 716.17
    },
    "莱欧斯利": {
      "hp": 14559.08,
      "atk": 380.89,
      "def": 817.42
    },
    "莱依拉": {
      "hp": 11859.69,
      "atk": 271.92,
      "def": 700.54
    },
    "蓝砚": {
      "hp": 9883.07,
      "atk": 314.57,
      "def": 620.27
    },
    "雷电将军": {
      "hp": 13824.57,
      "atk": 413.12,
      "def": 845.4
    },
    "雷泽": {
      "hp": 12789.86,
      "atk": 293.25,
      "def": 802.71
    },
    "丽莎": {
      "hp": 10231.89,
      "atk": 290.58,
      "def": 612.98
    },
    "莉奈娅": {
      "hp": 10597.96,
      "atk": 175.79,
      "def": 971.35
    },
    "林尼": {
      "hp": 11804.66,
      "atk": 389.68,
      "def": 576.23
    },
    "琳妮特": {
      "hp": 13254.94,
      "atk": 290.58,
      "def": 761.11
    },
    "流浪者": {
      "hp": 10886.52,
      "atk": 401.4,
      "def": 650.31
    },
    "鹿野院平藏": {
      "hp": 11394.6,
      "atk": 282.58,
      "def": 731.19
    },
    "旅行者": {
      "hp": 11627.14,
      "atk": 266.59,
      "def": 729.73
    },
    "罗莎莉亚": {
      "hp": 13138.67,
      "atk": 301.24,
      "def": 758.92
    },
    "洛恩": {
      "hp": 13772.11,
      "atk": 421.91,
      "def": 839.64
    },
    "玛拉妮": {
      "hp": 16264.2,
      "atk": 222.67,
      "def": 610.8
    },
    "玛薇卡": {
      "hp": 13444.2,
      "atk": 439.49,
      "def": 847.87
    },
    "梦见月瑞希": {
      "hp": 13640.94,
      "atk": 263.69,
      "def": 810.83
    },
    "米卡": {
      "hp": 13371.21,
      "atk": 279.92,
      "def": 762.57
    },
    "莫娜": {
      "hp": 11148.85,
      "atk": 351.59,
      "def": 699.7
    },
    "那维莱特": {
      "hp": 15739.55,
      "atk": 255.19,
      "def": 617.38
    },
    "纳西妲": {
      "hp": 11096.38,
      "atk": 366.24,
      "def": 675.01
    },
    "娜维娅": {
      "hp": 13549.13,
      "atk": 430.7,
      "def": 849.52
    },
    "奈芙尔": {
      "hp": 13606.84,
      "atk": 421.91,
      "def": 856.11
    },
    "妮露": {
      "hp": 16264.2,
      "atk": 281.27,
      "def": 780.37
    },
    "尼可": {
      "hp": 11148.85,
      "atk": 418.98,
      "def": 602.57
    },
    "凝光": {
      "hp": 10464.43,
      "atk": 266.59,
      "def": 612.98
    },
    "诺艾尔": {
      "hp": 12906.13,
      "atk": 239.93,
      "def": 853.79
    },
    "欧洛伦": {
      "hp": 9883.07,
      "atk": 306.57,
      "def": 627.57
    },
    "七七": {
      "hp": 13247.45,
      "atk": 351.59,
      "def": 987.81
    },
    "绮良良": {
      "hp": 13022.4,
      "atk": 279.92,
      "def": 583.79
    },
    "恰斯卡": {
      "hp": 10493.03,
      "atk": 424.84,
      "def": 658.54
    },
    "千织": {
      "hp": 12250.62,
      "atk": 395.54,
      "def": 1020.74
    },
    "茜特菈莉": {
      "hp": 12460.48,
      "atk": 155.28,
      "def": 817.42
    },
    "琴": {
      "hp": 15739.55,
      "atk": 292.99,
      "def": 823.18
    },
    "赛诺": {
      "hp": 13378.62,
      "atk": 389.68,
      "def": 920.31
    },
    "赛索斯": {
      "hp": 10464.43,
      "atk": 285.25,
      "def": 598.38
    },
    "桑多涅": {
      "hp": 14165.6,
      "atk": 418.98,
      "def": 805.89
    },
    "砂糖": {
      "hp": 9883.07,
      "atk": 213.27,
      "def": 751.62
    },
    "珊瑚宫心海": {
      "hp": 14427.92,
      "atk": 287.13,
      "def": 703.82
    },
    "申鹤": {
      "hp": 13916.39,
      "atk": 372.1,
      "def": 889.03
    },
    "神里绫华": {
      "hp": 13772.11,
      "atk": 418.98,
      "def": 839.64
    },
    "神里绫人": {
      "hp": 14690.25,
      "atk": 366.24,
      "def": 823.18
    },
    "丝柯克": {
      "hp": 13299.92,
      "atk": 439.49,
      "def": 863.51
    },
    "塔利雅": {
      "hp": 13371.21,
      "atk": 237.26,
      "def": 598.38
    },
    "提纳里": {
      "hp": 11621.03,
      "atk": 328.15,
      "def": 675.01
    },
    "托马": {
      "hp": 11045.79,
      "atk": 253.26,
      "def": 802.71
    },
    "瓦雷莎": {
      "hp": 13601.59,
      "atk": 436.56,
      "def": 837.17
    },
    "温迪": {
      "hp": 11280.01,
      "atk": 322.29,
      "def": 716.17
    },
    "五郎": {
      "hp": 10231.89,
      "atk": 229.26,
      "def": 693.25
    },
    "希格雯": {
      "hp": 14296.76,
      "atk": 235.86,
      "def": 535.07
    },
    "希诺宁": {
      "hp": 13286.8,
      "atk": 336.94,
      "def": 996.05
    },
    "夏洛蒂": {
      "hp": 11510.87,
      "atk": 217.27,
      "def": 583.79
    },
    "夏沃蕾": {
      "hp": 12789.86,
      "atk": 242.59,
      "def": 646.54
    },
    "闲云": {
      "hp": 11148.85,
      "atk": 410.19,
      "def": 613.27
    },
    "香菱": {
      "hp": 11627.14,
      "atk": 282.58,
      "def": 715.14
    },
    "宵宫": {
      "hp": 10886.52,
      "atk": 395.54,
      "def": 658.54
    },
    "魈": {
      "hp": 13640.94,
      "atk": 427.77,
      "def": 856.11
    },
    "辛焱": {
      "hp": 11975.96,
      "atk": 311.91,
      "def": 853.79
    },
    "行秋": {
      "hp": 10929.51,
      "atk": 253.26,
      "def": 810
    },
    "雅珂达": {
      "hp": 10313.28,
      "atk": 279.92,
      "def": 620.27
    },
    "烟绯": {
      "hp": 9999.34,
      "atk": 301.24,
      "def": 627.57
    },
    "瑶瑶": {
      "hp": 13138.67,
      "atk": 266.59,
      "def": 802.71
    },
    "叶洛亚": {
      "hp": 12789.86,
      "atk": 239.93,
      "def": 869.84
    },
    "夜兰": {
      "hp": 15477.22,
      "atk": 298.85,
      "def": 586.93
    },
    "伊安珊": {
      "hp": 11394.6,
      "atk": 322.57,
      "def": 682.3
    },
    "伊法": {
      "hp": 10778.36,
      "atk": 223.93,
      "def": 647.27
    },
    "伊涅芙": {
      "hp": 13509.78,
      "atk": 404.33,
      "def": 886.56
    },
    "优菈": {
      "hp": 14165.6,
      "atk": 418.98,
      "def": 804.25
    },
    "云堇": {
      "hp": 11394.6,
      "atk": 239.93,
      "def": 785.19
    },
    "早柚": {
      "hp": 12673.59,
      "atk": 306.57,
      "def": 796.14
    },
    "钟离": {
      "hp": 15739.55,
      "atk": 307.64,
      "def": 790.25
    },
    "重云": {
      "hp": 11743.41,
      "atk": 279.92,
      "def": 693.25
    },
    "兹白": {
      "hp": 13837.69,
      "atk": 275.41,
      "def": 1024.86
    }
  },
  "charElemMap": {
    "阿贝多": "geo",
    "阿蕾奇诺": "pyro",
    "阿罗夏": "electro",
    "埃洛伊": "cryo",
    "艾尔海森": "dendro",
    "艾梅莉埃": "dendro",
    "爱可菲": "cryo",
    "爱诺": "hydro",
    "安柏": "pyro",
    "奥黛塔": "cryo",
    "八重神子": "electro",
    "芭芭拉": "hydro",
    "白术": "dendro",
    "班尼特": "pyro",
    "北斗": "electro",
    "布伦妮": "anemo",
    "达达利亚": "hydro",
    "迪奥娜": "cryo",
    "迪卢克": "pyro",
    "迪希雅": "pyro",
    "杜林": "pyro",
    "多莉": "electro",
    "法尔伽": "anemo",
    "珐露珊": "anemo",
    "菲林斯": "electro",
    "菲米尼": "cryo",
    "菲谢尔": "electro",
    "枫原万叶": "anemo",
    "芙宁娜": "hydro",
    "甘雨": "cryo",
    "哥伦比娅": "hydro",
    "胡桃": "pyro",
    "荒泷一斗": "geo",
    "基尼奇": "dendro",
    "嘉明": "pyro",
    "九条裟罗": "electro",
    "久岐忍": "electro",
    "卡齐娜": "geo",
    "卡维": "dendro",
    "凯亚": "cryo",
    "坎蒂丝": "hydro",
    "柯莱": "dendro",
    "可莉": "pyro",
    "克洛琳德": "electro",
    "刻晴": "electro",
    "菈乌玛": "dendro",
    "莱欧斯利": "cryo",
    "莱依拉": "cryo",
    "蓝砚": "anemo",
    "雷电将军": "electro",
    "雷泽": "electro",
    "丽莎": "electro",
    "莉奈娅": "geo",
    "林尼": "pyro",
    "琳妮特": "anemo",
    "流浪者": "anemo",
    "鹿野院平藏": "anemo",
    "旅行者": "multi",
    "罗莎莉亚": "cryo",
    "洛恩": "cryo",
    "玛拉妮": "hydro",
    "玛薇卡": "pyro",
    "梦见月瑞希": "anemo",
    "米卡": "cryo",
    "莫娜": "hydro",
    "那维莱特": "hydro",
    "纳西妲": "dendro",
    "娜维娅": "geo",
    "奈芙尔": "dendro",
    "妮露": "hydro",
    "尼可": "pyro",
    "凝光": "geo",
    "诺艾尔": "geo",
    "欧洛伦": "electro",
    "七七": "cryo",
    "绮良良": "dendro",
    "恰斯卡": "anemo",
    "千织": "geo",
    "茜特菈莉": "cryo",
    "琴": "anemo",
    "赛诺": "electro",
    "赛索斯": "electro",
    "桑多涅": "cryo",
    "砂糖": "anemo",
    "珊瑚宫心海": "hydro",
    "申鹤": "cryo",
    "神里绫华": "cryo",
    "神里绫人": "hydro",
    "丝柯克": "cryo",
    "塔利雅": "hydro",
    "提纳里": "dendro",
    "托马": "pyro",
    "瓦雷莎": "electro",
    "温迪": "anemo",
    "五郎": "geo",
    "希格雯": "hydro",
    "希诺宁": "geo",
    "夏洛蒂": "cryo",
    "夏沃蕾": "pyro",
    "闲云": "anemo",
    "香菱": "pyro",
    "宵宫": "pyro",
    "魈": "anemo",
    "辛焱": "pyro",
    "行秋": "hydro",
    "雅珂达": "anemo",
    "烟绯": "pyro",
    "瑶瑶": "dendro",
    "叶洛亚": "geo",
    "夜兰": "hydro",
    "伊安珊": "electro",
    "伊法": "anemo",
    "伊涅芙": "electro",
    "优菈": "cryo",
    "云堇": "geo",
    "早柚": "anemo",
    "钟离": "geo",
    "重云": "cryo",
    "兹白": "geo"
  }
}
