export default {
  "source": {
    "version": "7.1.53",
    "revision": 48845164,
    "url": "https://gi.gachabase.net/weapons/14525/starsealed-edict/beta/7.1.53/48845164?lang=chs"
  },
  "id": 14525,
  "name": "StarsealedEdict",
  "nameZh": "秘星典谕",
  "attributes": [
    {
      "attribute_id": 4,
      "curve_id": 1304,
      "value": 44.3358
    },
    {
      "attribute_id": 22,
      "curve_id": 2301,
      "value": 0.192
    }
  ],
  "promotions": [
    {
      "level": 0,
      "stat_additions": []
    },
    {
      "level": 1,
      "stat_additions": [
        {
          "stat_id": 4,
          "value": 31.1
        }
      ]
    },
    {
      "level": 2,
      "stat_additions": [
        {
          "stat_id": 4,
          "value": 62.2
        }
      ]
    },
    {
      "level": 3,
      "stat_additions": [
        {
          "stat_id": 4,
          "value": 93.4
        }
      ]
    },
    {
      "level": 4,
      "stat_additions": [
        {
          "stat_id": 4,
          "value": 124.5
        }
      ]
    },
    {
      "level": 5,
      "stat_additions": [
        {
          "stat_id": 4,
          "value": 155.6
        }
      ]
    },
    {
      "level": 6,
      "stat_additions": [
        {
          "stat_id": 4,
          "value": 186.7
        }
      ]
    }
  ],
  "curves": {
    "1304": {
      "id": 1304,
      "operation": 2,
      "values": [
        1,
        1.079,
        1.159,
        1.238,
        1.317,
        1.395,
        1.474,
        1.552,
        1.631,
        1.709,
        1.787,
        1.865,
        1.942,
        2.02,
        2.098,
        2.175,
        2.253,
        2.33,
        2.408,
        2.485,
        2.562,
        2.639,
        2.717,
        2.794,
        2.871,
        2.948,
        3.026,
        3.103,
        3.18,
        3.257,
        3.334,
        3.412,
        3.489,
        3.566,
        3.644,
        3.721,
        3.798,
        3.876,
        3.953,
        4.031,
        4.109,
        4.186,
        4.264,
        4.342,
        4.419,
        4.497,
        4.575,
        4.653,
        4.731,
        4.81,
        4.888,
        4.966,
        5.044,
        5.123,
        5.201,
        5.28,
        5.359,
        5.437,
        5.516,
        5.595,
        5.674,
        5.753,
        5.833,
        5.912,
        5.991,
        6.071,
        6.15,
        6.23,
        6.31,
        6.39,
        6.47,
        6.55,
        6.63,
        6.71,
        6.791,
        6.871,
        6.952,
        7.033,
        7.113,
        7.194,
        7.275,
        7.357,
        7.438,
        7.519,
        7.601,
        7.682,
        7.764,
        7.846,
        7.928,
        8.01,
        8.092,
        8.174,
        8.257,
        8.339,
        8.422,
        8.505,
        8.588,
        8.671,
        8.754,
        8.837
      ]
    },
    "2301": {
      "id": 2301,
      "operation": 2,
      "values": [
        1,
        1,
        1,
        1,
        1.162,
        1.162,
        1.162,
        1.162,
        1.162,
        1.363,
        1.363,
        1.363,
        1.363,
        1.363,
        1.565,
        1.565,
        1.565,
        1.565,
        1.565,
        1.767,
        1.767,
        1.767,
        1.767,
        1.767,
        1.969,
        1.969,
        1.969,
        1.969,
        1.969,
        2.171,
        2.171,
        2.171,
        2.171,
        2.171,
        2.373,
        2.373,
        2.373,
        2.373,
        2.373,
        2.575,
        2.575,
        2.575,
        2.575,
        2.575,
        2.777,
        2.777,
        2.777,
        2.777,
        2.777,
        2.979,
        2.979,
        2.979,
        2.979,
        2.979,
        3.181,
        3.181,
        3.181,
        3.181,
        3.181,
        3.383,
        3.383,
        3.383,
        3.383,
        3.383,
        3.585,
        3.585,
        3.585,
        3.585,
        3.585,
        3.786,
        3.786,
        3.786,
        3.786,
        3.786,
        3.988,
        3.988,
        3.988,
        3.988,
        3.988,
        4.19,
        4.19,
        4.19,
        4.19,
        4.19,
        4.392,
        4.392,
        4.392,
        4.392,
        4.392,
        4.594,
        4.594,
        4.594,
        4.594,
        4.594,
        4.796,
        4.796,
        4.796,
        4.796,
        4.796,
        4.998
      ]
    }
  },
  "refinements": [
    {
      "name": "辰星的流迹",
      "description": "暴击伤害提升<color=#99FFFFFF>24%</color>。施放元素战技时，装备者获得「晶质调合」效果：元素精通提升<color=#99FFFFFF>48</color>点，持续20秒；持续期间，队伍中附近的角色触发元素反应时，装备者还会获得一层「炬中法度」，使元素精通进一步提升<color=#99FFFFFF>24</color>点，该效果至多叠加3层，持续至「晶质调合」效果结束或再次施放元素战技。\\n<color=#FFD780FF>辉映·星超导</color>：每层「炬中法度」还会使装备者造成的星超导反应伤害的暴击伤害提升<color=#99FFFFFF>12%</color>。\\n装备者处于队伍后台时，依然能触发上述效果。",
      "parameters": [
        48,
        24,
        0.12,
        20,
        0,
        3,
        5,
        0.75
      ]
    },
    {
      "name": "辰星的流迹",
      "description": "暴击伤害提升<color=#99FFFFFF>30%</color>。施放元素战技时，装备者获得「晶质调合」效果：元素精通提升<color=#99FFFFFF>60</color>点，持续20秒；持续期间，队伍中附近的角色触发元素反应时，装备者还会获得一层「炬中法度」，使元素精通进一步提升<color=#99FFFFFF>30</color>点，该效果至多叠加3层，持续至「晶质调合」效果结束或再次施放元素战技。\\n<color=#FFD780FF>辉映·星超导</color>：每层「炬中法度」还会使装备者造成的星超导反应伤害的暴击伤害提升<color=#99FFFFFF>15%</color>。\\n装备者处于队伍后台时，依然能触发上述效果。",
      "parameters": [
        60,
        30,
        0.15,
        20,
        0,
        3,
        5,
        0.75
      ]
    },
    {
      "name": "辰星的流迹",
      "description": "暴击伤害提升<color=#99FFFFFF>36%</color>。施放元素战技时，装备者获得「晶质调合」效果：元素精通提升<color=#99FFFFFF>72</color>点，持续20秒；持续期间，队伍中附近的角色触发元素反应时，装备者还会获得一层「炬中法度」，使元素精通进一步提升<color=#99FFFFFF>36</color>点，该效果至多叠加3层，持续至「晶质调合」效果结束或再次施放元素战技。\\n<color=#FFD780FF>辉映·星超导</color>：每层「炬中法度」还会使装备者造成的星超导反应伤害的暴击伤害提升<color=#99FFFFFF>18%</color>。\\n装备者处于队伍后台时，依然能触发上述效果。",
      "parameters": [
        72,
        36,
        0.18,
        20,
        0,
        3,
        5,
        0.75
      ]
    },
    {
      "name": "辰星的流迹",
      "description": "暴击伤害提升<color=#99FFFFFF>42%</color>。施放元素战技时，装备者获得「晶质调合」效果：元素精通提升<color=#99FFFFFF>84</color>点，持续20秒；持续期间，队伍中附近的角色触发元素反应时，装备者还会获得一层「炬中法度」，使元素精通进一步提升<color=#99FFFFFF>42</color>点，该效果至多叠加3层，持续至「晶质调合」效果结束或再次施放元素战技。\\n<color=#FFD780FF>辉映·星超导</color>：每层「炬中法度」还会使装备者造成的星超导反应伤害的暴击伤害提升<color=#99FFFFFF>21%</color>。\\n装备者处于队伍后台时，依然能触发上述效果。",
      "parameters": [
        84,
        42,
        0.21,
        20,
        0,
        3,
        5,
        0.75
      ]
    },
    {
      "name": "辰星的流迹",
      "description": "暴击伤害提升<color=#99FFFFFF>48%</color>。施放元素战技时，装备者获得「晶质调合」效果：元素精通提升<color=#99FFFFFF>96</color>点，持续20秒；持续期间，队伍中附近的角色触发元素反应时，装备者还会获得一层「炬中法度」，使元素精通进一步提升<color=#99FFFFFF>48</color>点，该效果至多叠加3层，持续至「晶质调合」效果结束或再次施放元素战技。\\n<color=#FFD780FF>辉映·星超导</color>：每层「炬中法度」还会使装备者造成的星超导反应伤害的暴击伤害提升<color=#99FFFFFF>24%</color>。\\n装备者处于队伍后台时，依然能触发上述效果。",
      "parameters": [
        96,
        48,
        0.24,
        20,
        0,
        3,
        5,
        0.75
      ]
    }
  ]
};
